In [ ]:
#creating a table with SQL

# create table rental
# (
# rental_id integer primary key not null,
# 	rental_date date not null,
# 	customer_id  integer  not null,
# 	return_date date not null,
# 	staff_id integer not null
# )
# create table staff
# (
# staff_id numeric primary key not null,
# 	first_name varchar(20) not null,
#     last_name  varchar(15) not null,
# 	email  integer     not null,
# 	user_name  integer not null
# )
# create table payment 
# (
# payment_id  numeric primary key not null,
# 	customer_id  integer not null,
# 	staff_id  integer not null,
# 	amount numeric  not null,
# 	payment_date date 
# )
#insert Into 
#insert into payment (payment_id, customer_id, staff_id,amount) values (1201, 101, 3,8.150)
#insert into rental (rental_id, customer_id,  staff_id) values (5, 105,  35)
#insert into staff (staff_id, first_name, last_name, user_name) values (1, 'Kevin', 'Adam', 'Kevin149')
#data update
###customer_id update code in paymant table 
#UPDATE payment SET customer_id =100 WHERE customer_id = 102

#### first_name update code in staff table
#UPDATE staff SET first_name = 'John WHERE staff_id=3

###### staff_id  update code in rental table
# UPDATE rental SET  staff_id=50   WHERE customer_id = 103

## delete data

#DELETE  FROM rental WHERE rental_id =5 
#DELETE FROM staff  WHERE first_name = 'Kevin'
#DELETE FROM  payment WHERE customer_id = 104

## drop table
#DROP TABLE payment
#Qestion 19 / 20
##copying data from one table by creating another table

#SELECT staff_id, user_name  INSERT INTO backup_staff FROM staff

#SELECT film_id , lenght ,title INSERT INTO backup_film FROM film
#Qestion 21 / 22 / 23 
#Qestion 24 done

#TRUNCATE TABLE backup_film
#TRUNCATE TABLE backup_staff
#TRUNCATE TABLE staff
#Qestion 25
#DROP TABLE rental
#DROP TABLE customer